//practiceA.c
##################################
1
2 3
test
##################################
##################################
##################################
##################################
##################################
##################################
##################################
#include<stdio.h>
int a,b,c;
char s[101];
int main(void)
{
  scanf("%d",&a);
  scanf("%d %d",&b,&c);
  scanf("%s",s);
  printf("%d %s",a+b+c,s);
};
##################################
#include <stdio.h>

int main(void)
{
  int a, b, c;
  char  s[101];
  scanf("%d", &a);
  scanf("%d %d", &b, &c);
  scanf("%s", s);
  printf("%d %s\n", a + b + c, s);
  return 0;
}
##################################
#include<stdio.h>
int main()
{
    int a,b,c;
    char s[101];
    // 整数の入力
    scanf("%d", &a);
    // スペース区切りの整数の入力
    scanf("%d %d",&b,&c);
    // 文字列の入力
    scanf("%s",s);
    // 出力
    printf("%d %s\n",a+b+c,s);
    return 0;
}
##################################
